# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']

for name in range(len(names)):
    print(names[name])


# count = 0

# for name in names:
#     count += 1
#     print(count)
# print(names[count])
